-- Генерация значений для таблицы City
INSERT INTO City (name) VALUES
('Новосибирск'),
('Москва'),
('Санкт-Петербург'),
('Екатеринбург'),
('Казань');

-- Генерация значений для таблицы MeetingRoom
INSERT INTO MeetingRoom (name, description, floor) VALUES
('Конференц-зал 1', 'Просторный зал для конференций', 5),
('Конференц-зал 2', 'Маленький зал для совещаний', 3),
('Переговорная 1', 'Уютная комната для небольших встреч', 2),
('Переговорная 2', NULL, 4),
('Переговорная 3', 'Зал для встреч с высокотехнологичным оборудованием', 6);

-- Генерация значений для таблицы ProfilePeer
INSERT INTO ProfilePeer (id_tg, nickname, city_id, tg_peername, limit, warning_count) VALUES
(123456789, 'user1', 1, 'tg_name1', 10, 2),
(987654321, 'user2', 2, 'tg_name2', 15, 0),
(456789123, 'user3', 1, NULL, 20, 1),
(789123456, 'user4', 3, 'tg_name3', 12, 0),
(654321987, 'user5', 2, NULL, 18, 3);

-- Генерация значений для таблицы ProfileAdmin
INSERT INTO ProfileAdmin (peer_id, access) VALUES
(1, 1),
(2, 2),
(3, 1),
(4, 3),
(5, 2);

-- Генерация значений для таблицы VisitLog
INSERT INTO VisitLog (meeting_room_id, peer_id, date, start_time, end_time) VALUES
(1, 1, '2024-03-30', '08:00:00', '09:00:00'),
(2, 2, '2024-03-30', '10:00:00', '11:30:00'),
(3, 3, '2024-03-30', '12:00:00', '13:00:00'),
(4, 4, '2024-03-30', '14:00:00', '15:30:00'),
(5, 5, '2024-03-30', '16:00:00', '17:00:00');